blog/2022/07/keeping-webos-developer-mode-alive-with-home-assistant/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Keeping LG webOS Developer Mode alive with Home Assistant</title>
<meta name="author" content="Elis Hirwing &lt;elis@hirwing.se&gt;" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/style.css" />
<link rel="alternate" type="application/rss+xml" title="~elis/blog/" href="/blog/rss.xml" />
<link rel="icon" href="/imgs/favicon.jpg">
<meta name="referrer" content="no-referrer" />
<!-- Global site tag (gtag.js) - Google Analytics -->
</head>
<body>
<div id="preamble" class="status">
<nav>
     <ul>
       <li><a href="/">~elis/</a></li>
       <li><a href="/about/">./about/</a></li>
       <li><a href="/work/">./work/</a></li>
       <li><a href="/talks/">./talks/</a></li>
       <li><a href="/blog/">./blog/</a></li>
     </ul>
   </nav>
</div>
<div id="content" class="content">
<h1 class="title">Keeping LG webOS Developer Mode alive with Home Assistant</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="/blog/2022/07/keeping-webos-developer-mode-alive-with-home-assistant/#keeping-the-session-alive">Keeping the session alive</a>
<ul>
<li><a href="/blog/2022/07/keeping-webos-developer-mode-alive-with-home-assistant/#first-attempt-using-a-systemd-timer">First attempt using a systemd timer</a></li>
<li><a href="/blog/2022/07/keeping-webos-developer-mode-alive-with-home-assistant/#second-attempt-using-home-assistant">Second attempt using Home Assistant</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
For over 10 years I've used <a href="https://kodi.tv/">Kodi</a> on a separate PC connected to a TV to play
back local media.
</p>

<p>
A couple of weeks ago everything changed in a matter of days. I listened to
<a href="https://latenightlinux.com/late-night-linux-episode-179/">Late Night Linux – Episode 179</a> where they talked about <a href="https://jellyfin.org/">Jellyfin</a>. I have
looked into Jellyfin before, however I've disregarded it due to the lack of
app for LG webOS. This changed because the podcast episode told that there
was a webOS app for Jellyfin.
</p>

<p>
So I did what most people would do, I went into the LG Content Store and
searched for "jellyfin", no result. So I went and searched on the
internet. There I found that there was a <a href="https://github.com/jellyfin/jellyfin-webos/">webOS client for Jellyfin</a>. However
at this point it wasn't pushed to the content store (yet), so I followed
their directions in the README to enable the Developer Mode and to install it
myself.
</p>

<p>
Some time passed by and then the Jellyfin app just "went away" and we didn't
know what happened.
</p>

<p>
Since starting to use Jellyfin on webOS they have officially launched a webOS
app for webOS 6 or newer, however, if you're on an older version of webOS
it's not out just yet <a href="https://github.com/jellyfin/jellyfin-webos/issues/69#issuecomment-1179454229">Comment in thread for Publish to Store for
10.8</a>. However, I manage to have a LG TV from 2021 that has webOS 5.4. So I
have to wait a bit longer.
</p>

<article id="outline-container-keeping-the-session-alive" class="outline-2">
<h2 id="keeping-the-session-alive">Keeping the session alive</h2>
<div class="outline-text-2" id="text-keeping-the-session-alive">
<p>
So the Developer Mode app has a session timer within itself, this is lasting
50 hours. When 50 hours has passed it will log out and remove your developer
mode apps.
</p>

<p>
This 50 hours doesn't seem to be "powered on hours", instead it's human time
passed amount in hours.
</p>

<p>
This is a bit inconvenient since it would mean that you'd have to go into the
Developer Mode app every second day and press a button to not have Jellyfin
going away.
</p>
</div>

<div id="outline-container-first-attempt-using-a-systemd-timer" class="outline-3">
<h3 id="first-attempt-using-a-systemd-timer">First attempt using a systemd timer</h3>
<div class="outline-text-3" id="text-first-attempt-using-a-systemd-timer">
<p>
Some time passed by, then I listened to <a href="https://latenightlinux.com/late-night-linux-episode-183/">Late Night Linux – Episode 183</a> where
they talked about the webOS device manager and that one could use a cron-job
to renew the session, so I found this script <a href="https://github.com/webosbrew/dev-utils/blob/main/scripts/devmode-reset.sh">devmode-reset.sh from
webosbrew</a>. So I integrated it into my <a href="https://github.com/etu/nixconfig/commit/e5eb4272f96af0625f59f0c0b23b3bf6e880696b">NixOS configuration</a> to run this script
every night.
</p>

<p>
The script, all the bits worked, like fetching the token from the TV itself
and posting it to LG all seemed to work. I got a <code>200 OK</code> back from LG with
some JSON telling me that it seemed fine.
</p>

<p>
However, the session never extended from this method.
</p>
</div>
</div>

<div id="outline-container-second-attempt-using-home-assistant" class="outline-3">
<h3 id="second-attempt-using-home-assistant">Second attempt using Home Assistant</h3>
<div class="outline-text-3" id="text-second-attempt-using-home-assistant">
<p>
Then it struck me, <a href="https://www.home-assistant.io/">Home Assistant</a> is capable of running series of commands,
including sending Wake-On-LAN packages, switching input on TV's, sending fake
button presses and turning of TV's. So it requires to have the line
<code>wake_on_lan:</code> in <code>configuration.yaml</code> to enable Wake-On-LAN, then you'd have
to have the Home Assistant integration set up with the TV itself.
</p>

<p>
So now I have a script in home assistant that does exactly this:
</p>
<ol class="org-ol">
<li>Turn on TV (then wait 10 seconds)</li>
<li>Switch to the Developer Mode app (then wait 5 seconds)</li>
<li>Loop twice to press the DOWN button (then wait 1 second)</li>
<li>Press the ENTER button (then wait 5 seconds)</li>
<li>Turn off the TV</li>
</ol>

<p>
This script is then put in an automation that is executed in the middle of
the night (if the TV is off to not disrupt any late night TV watching).
</p>

<p>
This is pulled from my <code>scripts.yaml</code>:
</p>
<div class="org-src-container">
<pre class="src src-yaml"><span class="org-variable-name">tv_extend_developer_session_time</span>:
  <span class="org-variable-name">alias</span>: <span class="org-string">'TV: Extend developer session time'</span>
  <span class="org-variable-name">sequence</span>:
  - <span class="org-variable-name">service</span>: wake_on_lan.send_magic_packet
    <span class="org-variable-name">data</span>:
      <span class="org-variable-name">mac</span>: <span class="org-string">""</span> <span class="org-comment-delimiter"># </span><span class="org-comment">INSERT YOUR TV's MAC ADDRESS HERE</span>
  - <span class="org-variable-name">delay</span>:
      <span class="org-variable-name">hours</span>: 0
      <span class="org-variable-name">minutes</span>: 0
      <span class="org-variable-name">seconds</span>: 10
      <span class="org-variable-name">milliseconds</span>: 0
  - <span class="org-variable-name">service</span>: media_player.select_source
    <span class="org-variable-name">data</span>:
      <span class="org-variable-name">source</span>: Developer Mode
    <span class="org-variable-name">target</span>:
      <span class="org-variable-name">entity_id</span>: media_player.lg_webos_smart_tv <span class="org-comment-delimiter"># </span><span class="org-comment">MAKE SURE THIS MATCHES YOUR INTEGRATION SETUP</span>
  - <span class="org-variable-name">delay</span>:
      <span class="org-variable-name">hours</span>: 0
      <span class="org-variable-name">minutes</span>: 0
      <span class="org-variable-name">seconds</span>: 5
      <span class="org-variable-name">milliseconds</span>: 0
  - <span class="org-variable-name">repeat</span>:
      <span class="org-variable-name">count</span>: 2
      <span class="org-variable-name">sequence</span>:
      - <span class="org-variable-name">service</span>: webostv.button
<span class="org-yaml-tab">        </span><span class="org-variable-name">data</span>:
<span class="org-yaml-tab">        </span><span class="org-variable-name">  entity_id</span>: media_player.lg_webos_smart_tv <span class="org-comment-delimiter"># </span><span class="org-comment">MAKE SURE THIS MATCHES YOUR INTEGRATION SETUP</span>
<span class="org-yaml-tab">        </span><span class="org-variable-name">  button</span>: DOWN
  - <span class="org-variable-name">delay</span>:
      <span class="org-variable-name">hours</span>: 0
      <span class="org-variable-name">minutes</span>: 0
      <span class="org-variable-name">seconds</span>: 1
      <span class="org-variable-name">milliseconds</span>: 0
  - <span class="org-variable-name">service</span>: webostv.button
    <span class="org-variable-name">data</span>:
      <span class="org-variable-name">entity_id</span>: media_player.lg_webos_smart_tv <span class="org-comment-delimiter"># </span><span class="org-comment">MAKE SURE THIS MATCHES YOUR INTEGRATION SETUP</span>
      <span class="org-variable-name">button</span>: ENTER
  - <span class="org-variable-name">delay</span>:
      <span class="org-variable-name">hours</span>: 0
      <span class="org-variable-name">minutes</span>: 0
      <span class="org-variable-name">seconds</span>: 5
      <span class="org-variable-name">milliseconds</span>: 0
  - <span class="org-variable-name">service</span>: media_player.turn_off
    <span class="org-variable-name">data</span>: {<span class="org-variable-name">}</span>
<span class="org-variable-name">    target</span>:
      <span class="org-variable-name">entity_id</span>: media_player.lg_webos_smart_tv <span class="org-comment-delimiter"># </span><span class="org-comment">MAKE SURE THIS MATCHES YOUR INTEGRATION SETUP</span>
  <span class="org-variable-name">mode</span>: single
  <span class="org-variable-name">icon</span>: mdi:remote-tv
</pre>
</div>

<p>
This is pulled from my <code>automations.yaml</code>:
</p>
<div class="org-src-container">
<pre class="src src-yaml">- <span class="org-variable-name">alias</span>: <span class="org-string">'TV: Extend developer session time automation'</span>
  <span class="org-variable-name">description</span>: <span class="org-string">''</span>
  <span class="org-variable-name">trigger</span>:
  - <span class="org-variable-name">platform</span>: time
    <span class="org-variable-name">at</span>: 04:00:00
  <span class="org-variable-name">condition</span>:
  - <span class="org-variable-name">condition</span>: device
    <span class="org-variable-name">device_id</span>: 03387d9e75f0ab1b4e81c6a249f9806e <span class="org-comment-delimiter"># </span><span class="org-comment">MAKE SURE THIS MATCHES YOUR INTEGRATION SETUP</span>
    <span class="org-variable-name">domain</span>: media_player
    <span class="org-variable-name">entity_id</span>: media_player.lg_webos_smart_tv <span class="org-comment-delimiter"># </span><span class="org-comment">MAKE SURE THIS MATCHES YOUR INTEGRATION SETUP</span>
    <span class="org-variable-name">type</span>: is_off
  <span class="org-variable-name">action</span>:
  - <span class="org-variable-name">service</span>: script.tv_extend_developer_session_time
    <span class="org-variable-name">data</span>: {<span class="org-variable-name">}</span>
<span class="org-variable-name">  mode</span>: single
</pre>
</div>
</div>
</div>
</article>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-07-25 Mon 20:00</p>
<p class="author">Author: Elis Hirwing &lt;elis@hirwing.se&gt;</p>
</div>
</body>
</html>
